name: "nllb-600M_detokenize"
backend: "python"
max_batch_size: 8
input [
  {
    name: "output_ids"
    data_type: TYPE_INT64
    dims: [ -1 ]
  }
]
output [
  {
    name: "TEXT"
    data_type: TYPE_STRING
    dims: [ 1 ]
  }
]
instance_group [
  {
    kind: KIND_CPU  # Ensure the detokenizer runs on CPU
  }
]